# first = "2"
# second = "3"
# print(first + second)
#Программа выводит 23, так как складываются переменные строкового типа (string)
first = 2
second = 3
print(first + second)
#Программа выводит 5, так как был исправлен тип переменных со строкового (string) на целочисленный (integer)
# age = input("Возраст: ")
# print(age + 1)
#Программа выводит ошибку, так как при присваивании переменной значение через input
#оно по умолчанию является строковым типом (string) и не может быть сложено со значением
#целочисленного типа (integer)
age = int(input("Возраст: "))
print(age + 1)
#Программа работает верно, так как при присваивании переменной значения через input
#оно является целочисленным (integer) и складывается со значением того же типа.
first = 4
# second = 7
# third = 10
# average = first + second + third / 3
# print(average)
#При выполнении команды программа выводит 14.333333333333334, что является неверным,
#так как среднее арифметическое предполагает сумму всех переменных, делённую на их количество,
#а в данном случае программа сначала выполняет деление, а затем суммирует оставшиеся значения.
first = 4
second = 7
third = 10
average = (first + second + third) / 3
print(average)
#После того как мы взяли сумму трех переменных в скобки, программа сначала выполняет суммирование,
#а затем делит данную сумму на количество переменных и возвращает правильный ответ.

